wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.c
/**
  ******************************************************************************
  * @file    fm33l0xx_atim.c
  * @author  FM33L0 Application Team
  * @version V0.1.1
  * @date    6-Dec-2019
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of....:
  *
*/

/* Includes ------------------------------------------------------------------*/
#include "fm33l0xx_atim.h"  
#include "fm33l0xx_rcc.h"  
/** @addtogroup fm33l0_StdPeriph_Driver
  * @{
  */

/** @defgroup ATIM 
  * @brief ATIM driver modules
  * @{
  */ 

void ATIM_TimeBaseInit(TIM_TimeBaseInitTypeDef* TIM_TimeBaseInitStruct)
{
  ATIM_CR1_CMS_Set(ATIM_CR1_CMS_SINGLE);//边沿对齐模式
  ATIM_CR1_DIR_Set(TIM_TimeBaseInitStruct->TIM_CounterMode);
  ATIM_CR1_CKD_Set(TIM_TimeBaseInitStruct->TIM_ClockDivision);
  
  ATIM_ARR_Write(TIM_TimeBaseInitStruct->TIM_Period);
  ATIM_PSC_Write(TIM_TimeBaseInitStruct->TIM_Prescaler);
  ATIM_RCR_Write(TIM_TimeBaseInitStruct->TIM_RepetitionCounter);
  
  ATIM_EGR_UG_Setable(ENABLE);//产生事件更新参数
}

void ATIM_ClearITPendingBit(uint32_t TIM_IT)
{
  ATIM->ISR = TIM_IT;
}

void ATIM_ITConfig(uint32_t TIM_IT, FunState NewState)
{  
  if (NewState != DISABLE)
  {
    ATIM->DIER |= TIM_IT;
  }
  else
  {
    ATIM->DIER &= ~TIM_IT;
  }
}

ITStatus ATIM_GetITStatus(uint32_t TIM_IT)
{ 
  uint32_t itstatus = 0x0, itenable = 0x0;
   
  itstatus = ATIM->ISR & TIM_IT;
  
  itenable = ATIM->DIER & TIM_IT;
  
  if ((itstatus != RESET) && (itenable != RESET))
  {
    return  SET;
  }
  else
  {
    return  RESET;
  }
}

void ATIM_Cmd(FunState NewState)
{
  
  if (NewState != DISABLE)
  {
    ATIM->CR1 |= ATIM_CR1_CEN_Msk;
  }
  else
  {
    ATIM->CR1 &= ~ATIM_CR1_CEN_Msk;
  }
}





/* Dead time和数字滤波时钟频率分频寄存器 相关函数 */
void ATIM_CR1_CKD_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CR1;
	tmpreg &= ~(ATIM_CR1_CKD_Msk);
	tmpreg |= (SetValue & ATIM_CR1_CKD_Msk);
	ATIM->CR1 = tmpreg;
}

uint32_t ATIM_CR1_CKD_Get(void)
{
	return (ATIM->CR1 & ATIM_CR1_CKD_Msk);
}

/* ARR预装载使能  相关函数 */
void ATIM_CR1_ARPE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CR1 |= (ATIM_CR1_ARPE_Msk);
	}
	else
	{
		ATIM->CR1 &= ~(ATIM_CR1_ARPE_Msk);
	}
}

FunState ATIM_CR1_ARPE_Getable(void)
{
	if (ATIM->CR1 & (ATIM_CR1_ARPE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 计数器对齐模式选择 相关函数 */
void ATIM_CR1_CMS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CR1;
	tmpreg &= ~(ATIM_CR1_CMS_Msk);
	tmpreg |= (SetValue & ATIM_CR1_CMS_Msk);
	ATIM->CR1 = tmpreg;
}

uint32_t ATIM_CR1_CMS_Get(void)
{
	return (ATIM->CR1 & ATIM_CR1_CMS_Msk);
}

/* 计数方向寄存器 相关函数 */
void ATIM_CR1_DIR_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CR1;
	tmpreg &= ~(ATIM_CR1_DIR_Msk);
	tmpreg |= (SetValue & ATIM_CR1_DIR_Msk);
	ATIM->CR1 = tmpreg;
}

uint32_t ATIM_CR1_DIR_Get(void)
{
	return (ATIM->CR1 & ATIM_CR1_DIR_Msk);
}

/* 单脉冲输出模式 相关函数 */
void ATIM_CR1_OPM_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CR1 |= (ATIM_CR1_OPM_Msk);
	}
	else
	{
		ATIM->CR1 &= ~(ATIM_CR1_OPM_Msk);
	}
}

FunState ATIM_CR1_OPM_Getable(void)
{
	if (ATIM->CR1 & (ATIM_CR1_OPM_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 更新请求选择 相关函数 */
void ATIM_CR1_URS_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CR1 |= (ATIM_CR1_URS_Msk);
	}
	else
	{
		ATIM->CR1 &= ~(ATIM_CR1_URS_Msk);
	}
}

FunState ATIM_CR1_URS_Getable(void)
{
	if (ATIM->CR1 & (ATIM_CR1_URS_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 禁止update 相关函数 */
void ATIM_CR1_UDIS_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CR1 |= (ATIM_CR1_UDIS_Msk);
	}
	else
	{
		ATIM->CR1 &= ~(ATIM_CR1_UDIS_Msk);
	}
}

FunState ATIM_CR1_UDIS_Getable(void)
{
	if (ATIM->CR1 & (ATIM_CR1_UDIS_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 计数器使能 相关函数 */
void ATIM_CR1_CEN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CR1 |= (ATIM_CR1_CEN_Msk);
	}
	else
	{
		ATIM->CR1 &= ~(ATIM_CR1_CEN_Msk);
	}
}

FunState ATIM_CR1_CEN_Getable(void)
{
	if (ATIM->CR1 & (ATIM_CR1_CEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 参考OIS1 相关函数 */
void ATIM_CR2_OIS4_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CR2 |= (ATIM_CR2_OIS4_Msk);
	}
	else
	{
		ATIM->CR2 &= ~(ATIM_CR2_OIS4_Msk);
	}
}

FunState ATIM_CR2_OIS4_Getable(void)
{
	if (ATIM->CR2 & (ATIM_CR2_OIS4_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 参考OIS1N 相关函数 */
void ATIM_CR2_OIS3N_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CR2 |= (ATIM_CR2_OIS3N_Msk);
	}
	else
	{
		ATIM->CR2 &= ~(ATIM_CR2_OIS3N_Msk);
	}
}

FunState ATIM_CR2_OIS3N_Getable(void)
{
	if (ATIM->CR2 & (ATIM_CR2_OIS3N_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 参考OIS1 相关函数 */
void ATIM_CR2_OIS3_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CR2 |= (ATIM_CR2_OIS3_Msk);
	}
	else
	{
		ATIM->CR2 &= ~(ATIM_CR2_OIS3_Msk);
	}
}

FunState ATIM_CR2_OIS3_Getable(void)
{
	if (ATIM->CR2 & (ATIM_CR2_OIS3_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 参考OIS1N 相关函数 */
void ATIM_CR2_OIS2N_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CR2 |= (ATIM_CR2_OIS2N_Msk);
	}
	else
	{
		ATIM->CR2 &= ~(ATIM_CR2_OIS2N_Msk);
	}
}

FunState ATIM_CR2_OIS2N_Getable(void)
{
	if (ATIM->CR2 & (ATIM_CR2_OIS2N_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 参考OIS1 相关函数 */
void ATIM_CR2_OIS2_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CR2 |= (ATIM_CR2_OIS2_Msk);
	}
	else
	{
		ATIM->CR2 &= ~(ATIM_CR2_OIS2_Msk);
	}
}

FunState ATIM_CR2_OIS2_Getable(void)
{
	if (ATIM->CR2 & (ATIM_CR2_OIS2_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* OC1N的输出IDLE状态 相关函数 */
void ATIM_CR2_OIS1N_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CR2 |= (ATIM_CR2_OIS1N_Msk);
	}
	else
	{
		ATIM->CR2 &= ~(ATIM_CR2_OIS1N_Msk);
	}
}

