wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.c
FunState ATIM_CR2_OIS1N_Getable(void)
{
	if (ATIM->CR2 & (ATIM_CR2_OIS1N_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* OC1的输出IDLE状态 相关函数 */
void ATIM_CR2_OIS1_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CR2 |= (ATIM_CR2_OIS1_Msk);
	}
	else
	{
		ATIM->CR2 &= ~(ATIM_CR2_OIS1_Msk);
	}
}

FunState ATIM_CR2_OIS1_Getable(void)
{
	if (ATIM->CR2 & (ATIM_CR2_OIS1_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* ATIM输入TI1选择 相关函数 */
void ATIM_CR2_TI1S_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CR2;
	tmpreg &= ~(ATIM_CR2_TI1S_Msk);
	tmpreg |= (SetValue & ATIM_CR2_TI1S_Msk);
	ATIM->CR2 = tmpreg;
}

uint32_t ATIM_CR2_TI1S_Get(void)
{
	return (ATIM->CR2 & ATIM_CR2_TI1S_Msk);
}

/* 主机模式选择，用于配置主机模式下向从机发送的同步触发信号（TRGO）源 相关函数 */
void ATIM_CR2_MMS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CR2;
	tmpreg &= ~(ATIM_CR2_MMS_Msk);
	tmpreg |= (SetValue & ATIM_CR2_MMS_Msk);
	ATIM->CR2 = tmpreg;
}

uint32_t ATIM_CR2_MMS_Get(void)
{
	return (ATIM->CR2 & ATIM_CR2_MMS_Msk);
}

/* 捕捉/比较 DMA选择 相关函数 */
void ATIM_CR2_CCDS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CR2;
	tmpreg &= ~(ATIM_CR2_CCDS_Msk);
	tmpreg |= (SetValue & ATIM_CR2_CCDS_Msk);
	ATIM->CR2 = tmpreg;
}

uint32_t ATIM_CR2_CCDS_Get(void)
{
	return (ATIM->CR2 & ATIM_CR2_CCDS_Msk);
}

/* 捕捉/比较控制寄存器更新选择 相关函数 */
void ATIM_CR2_CCUS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CR2;
	tmpreg &= ~(ATIM_CR2_CCUS_Msk);
	tmpreg |= (SetValue & ATIM_CR2_CCUS_Msk);
	ATIM->CR2 = tmpreg;
}

uint32_t ATIM_CR2_CCUS_Get(void)
{
	return (ATIM->CR2 & ATIM_CR2_CCUS_Msk);
}

void ATIM_CR2_CCPC_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CR2 |= (ATIM_CR2_CCPC_Msk);
	}
	else
	{
		ATIM->CR2 &= ~(ATIM_CR2_CCPC_Msk);
	}
}

FunState ATIM_CR2_CCPC_Getable(void)
{
	if (ATIM->CR2 & (ATIM_CR2_CCPC_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 外部触发信号极性配置 相关函数 */
void ATIM_SMCR_ETP_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->SMCR;
	tmpreg &= ~(ATIM_SMCR_ETP_Msk);
	tmpreg |= (SetValue & ATIM_SMCR_ETP_Msk);
	ATIM->SMCR = tmpreg;
}

uint32_t ATIM_SMCR_ETP_Get(void)
{
	return (ATIM->SMCR & ATIM_SMCR_ETP_Msk);
}

/* 外部时钟使能 相关函数 */
void ATIM_SMCR_ECE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->SMCR |= (ATIM_SMCR_ECE_Msk);
	}
	else
	{
		ATIM->SMCR &= ~(ATIM_SMCR_ECE_Msk);
	}
}

FunState ATIM_SMCR_ECE_Getable(void)
{
	if (ATIM->SMCR & (ATIM_SMCR_ECE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 外部触发信号预分频寄存器,外部触发信号ETRP的频率最多只能是ATIM工作时钟的1/4，当输入信号频率较高时，可以使用预分频 相关函数 */
void ATIM_SMCR_ETPS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->SMCR;
	tmpreg &= ~(ATIM_SMCR_ETPS_Msk);
	tmpreg |= (SetValue & ATIM_SMCR_ETPS_Msk);
	ATIM->SMCR = tmpreg;
}

uint32_t ATIM_SMCR_ETPS_Get(void)
{
	return (ATIM->SMCR & ATIM_SMCR_ETPS_Msk);
}

/* 外部触发信号滤波时钟和长度选择 相关函数 */
void ATIM_SMCR_ETF_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->SMCR;
	tmpreg &= ~(ATIM_SMCR_ETF_Msk);
	tmpreg |= (SetValue & ATIM_SMCR_ETF_Msk);
	ATIM->SMCR = tmpreg;
}

uint32_t ATIM_SMCR_ETF_Get(void)
{
	return (ATIM->SMCR & ATIM_SMCR_ETF_Msk);
}

/* 主机从机模式选 相关函数 */
void ATIM_SMCR_MSM_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->SMCR;
	tmpreg &= ~(ATIM_SMCR_MSM_Msk);
	tmpreg |= (SetValue & ATIM_SMCR_MSM_Msk);
	ATIM->SMCR = tmpreg;
}

uint32_t ATIM_SMCR_MSM_Get(void)
{
	return (ATIM->SMCR & ATIM_SMCR_MSM_Msk);
}

/* 触发选择，用于选择同步计数器的触发源 相关函数 */
void ATIM_SMCR_TS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->SMCR;
	tmpreg &= ~(ATIM_SMCR_TS_Msk);
	tmpreg |= (SetValue & ATIM_SMCR_TS_Msk);
	ATIM->SMCR = tmpreg;
}

uint32_t ATIM_SMCR_TS_Get(void)
{
	return (ATIM->SMCR & ATIM_SMCR_TS_Msk);
}

/* 从机模式选择 相关函数 */
void ATIM_SMCR_SMS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->SMCR;
	tmpreg &= ~(ATIM_SMCR_SMS_Msk);
	tmpreg |= (SetValue & ATIM_SMCR_SMS_Msk);
	ATIM->SMCR = tmpreg;
}

uint32_t ATIM_SMCR_SMS_Get(void)
{
	return (ATIM->SMCR & ATIM_SMCR_SMS_Msk);
}

/* 捕捉比较通道4的DMA模式配置 相关函数 */
void ATIM_DIER_CC4BURSTEN_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->DIER;
	tmpreg &= ~(ATIM_DIER_CC4BURSTEN_Msk);
	tmpreg |= (SetValue & ATIM_DIER_CC4BURSTEN_Msk);
	ATIM->DIER = tmpreg;
}

uint32_t ATIM_DIER_CC4BURSTEN_Get(void)
{
	return (ATIM->DIER & ATIM_DIER_CC4BURSTEN_Msk);
}

/* 捕捉比较通道3的DMA模式配置 相关函数 */
void ATIM_DIER_CC3BURSTEN_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->DIER;
	tmpreg &= ~(ATIM_DIER_CC3BURSTEN_Msk);
	tmpreg |= (SetValue & ATIM_DIER_CC3BURSTEN_Msk);
	ATIM->DIER = tmpreg;
}

uint32_t ATIM_DIER_CC3BURSTEN_Get(void)
{
	return (ATIM->DIER & ATIM_DIER_CC3BURSTEN_Msk);
}

/* 捕捉比较通道2的DMA模式配置 相关函数 */
void ATIM_DIER_CC2BURSTEN_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->DIER;
	tmpreg &= ~(ATIM_DIER_CC2BURSTEN_Msk);
	tmpreg |= (SetValue & ATIM_DIER_CC2BURSTEN_Msk);
	ATIM->DIER = tmpreg;
}

uint32_t ATIM_DIER_CC2BURSTEN_Get(void)
{
	return (ATIM->DIER & ATIM_DIER_CC2BURSTEN_Msk);
}

/* 捕捉比较通道1的DMA模式配置 相关函数 */
void ATIM_DIER_CC1BURSTEN_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->DIER;
	tmpreg &= ~(ATIM_DIER_CC1BURSTEN_Msk);
	tmpreg |= (SetValue & ATIM_DIER_CC1BURSTEN_Msk);
	ATIM->DIER = tmpreg;
}

uint32_t ATIM_DIER_CC1BURSTEN_Get(void)
{
	return (ATIM->DIER & ATIM_DIER_CC1BURSTEN_Msk);
}

/* 外部触发DMA请求使能 相关函数 */
void ATIM_DIER_TDE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_TDE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_TDE_Msk);
	}
}

FunState ATIM_DIER_TDE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_TDE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* COM事件DMA请求使能 相关函数 */
void ATIM_DIER_COMDE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_COMDE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_COMDE_Msk);
	}
}

