wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.c
FunState ATIM_DIER_COMDE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_COMDE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉比较通道4的DMA请求使能 相关函数 */
void ATIM_DIER_CC4DE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_CC4DE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_CC4DE_Msk);
	}
}

FunState ATIM_DIER_CC4DE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_CC4DE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉比较通道3的DMA请求使能 相关函数 */
void ATIM_DIER_CC3DE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_CC3DE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_CC3DE_Msk);
	}
}

FunState ATIM_DIER_CC3DE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_CC3DE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉比较通道2的DMA请求使能 相关函数 */
void ATIM_DIER_CC2DE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_CC2DE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_CC2DE_Msk);
	}
}

FunState ATIM_DIER_CC2DE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_CC2DE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉比较通道1的DMA请求使能 相关函数 */
void ATIM_DIER_CC1DE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_CC1DE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_CC1DE_Msk);
	}
}

FunState ATIM_DIER_CC1DE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_CC1DE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 更新事件DMA请求使能  相关函数 */
void ATIM_DIER_UDE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_UDE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_UDE_Msk);
	}
}

FunState ATIM_DIER_UDE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_UDE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 刹车事件中断使能 相关函数 */
void ATIM_DIER_BIE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_BIE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_BIE_Msk);
	}
}

FunState ATIM_DIER_BIE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_BIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 触发事件中断使能 相关函数 */
void ATIM_DIER_TIE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_TIE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_TIE_Msk);
	}
}

FunState ATIM_DIER_TIE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_TIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* COM事件中断使能 相关函数 */
void ATIM_DIER_COMIE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_COMIE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_COMIE_Msk);
	}
}

FunState ATIM_DIER_COMIE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_COMIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较通道4中断使能 相关函数 */
void ATIM_DIER_CC4IE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_CC4IE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_CC4IE_Msk);
	}
}

FunState ATIM_DIER_CC4IE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_CC4IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较通道3中断使能 相关函数 */
void ATIM_DIER_CC3IE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_CC3IE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_CC3IE_Msk);
	}
}

FunState ATIM_DIER_CC3IE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_CC3IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较通道2中断使能 相关函数 */
void ATIM_DIER_CC2IE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_CC2IE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_CC2IE_Msk);
	}
}

FunState ATIM_DIER_CC2IE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_CC2IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较通道1中断使能 相关函数 */
void ATIM_DIER_CC1IE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_CC1IE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_CC1IE_Msk);
	}
}

FunState ATIM_DIER_CC1IE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_CC1IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 更新事件中断使能 相关函数 */
void ATIM_DIER_UIE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->DIER |= (ATIM_DIER_UIE_Msk);
	}
	else
	{
		ATIM->DIER &= ~(ATIM_DIER_UIE_Msk);
	}
}

FunState ATIM_DIER_UIE_Getable(void)
{
	if (ATIM->DIER & (ATIM_DIER_UIE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较通道4的Overcapture中断 相关函数 */
void ATIM_ISR_CC4OF_Clr(void)
{
	ATIM->ISR = ATIM_ISR_CC4OF_Msk;
}

FlagStatus ATIM_ISR_CC4OF_Chk(void)
{
	if (ATIM->ISR & ATIM_ISR_CC4OF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道3的Overcapture中断 相关函数 */
void ATIM_ISR_CC3OF_Clr(void)
{
	ATIM->ISR = ATIM_ISR_CC3OF_Msk;
}

FlagStatus ATIM_ISR_CC3OF_Chk(void)
{
	if (ATIM->ISR & ATIM_ISR_CC3OF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道2的Overcapture中断 相关函数 */
void ATIM_ISR_CC2OF_Clr(void)
{
	ATIM->ISR = ATIM_ISR_CC2OF_Msk;
}

FlagStatus ATIM_ISR_CC2OF_Chk(void)
{
	if (ATIM->ISR & ATIM_ISR_CC2OF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道1的Overcapture中断，此寄存器仅在对应通道设置为输入捕捉模式的情况下有效。硬件置位，软件写1清零 相关函数 */
void ATIM_ISR_CC1OF_Clr(void)
{
	ATIM->ISR = ATIM_ISR_CC1OF_Msk;
}

FlagStatus ATIM_ISR_CC1OF_Chk(void)
{
	if (ATIM->ISR & ATIM_ISR_CC1OF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 刹车事件中断标志，硬件置位，软件写1清零 相关函数 */
void ATIM_ISR_BIF_Clr(void)
{
	ATIM->ISR = ATIM_ISR_BIF_Msk;
}

FlagStatus ATIM_ISR_BIF_Chk(void)
{
	if (ATIM->ISR & ATIM_ISR_BIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 触发事件中断标志，硬件置位，软件写1清零 相关函数 */
void ATIM_ISR_TIF_Clr(void)
{
	ATIM->ISR = ATIM_ISR_TIF_Msk;
}

