wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.c
FlagStatus ATIM_ISR_TIF_Chk(void)
{
	if (ATIM->ISR & ATIM_ISR_TIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* COM事件中断标志，硬件置位，软件写1清零 相关函数 */
void ATIM_ISR_COMIF_Clr(void)
{
	ATIM->ISR = ATIM_ISR_COMIF_Msk;
}

FlagStatus ATIM_ISR_COMIF_Chk(void)
{
	if (ATIM->ISR & ATIM_ISR_COMIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道4中断标志，参考CC1IF 相关函数 */
void ATIM_ISR_CC4IF_Clr(void)
{
	ATIM->ISR = ATIM_ISR_CC4IF_Msk;
}

FlagStatus ATIM_ISR_CC4IF_Chk(void)
{
	if (ATIM->ISR & ATIM_ISR_CC4IF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道3中断标志，参考CC1IF 相关函数 */
void ATIM_ISR_CC3IF_Clr(void)
{
	ATIM->ISR = ATIM_ISR_CC3IF_Msk;
}

FlagStatus ATIM_ISR_CC3IF_Chk(void)
{
	if (ATIM->ISR & ATIM_ISR_CC3IF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道2中断标志，参考CC1IF 相关函数 */
void ATIM_ISR_CC2IF_Clr(void)
{
	ATIM->ISR = ATIM_ISR_CC2IF_Msk;
}

FlagStatus ATIM_ISR_CC2IF_Chk(void)
{
	if (ATIM->ISR & ATIM_ISR_CC2IF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 捕捉/比较通道1中断标志，如果CC1通道配置为输出：CC1IF在计数值等于比较值时置位，软件写1清零。
如果CC1通道配置为输入：发生捕捉事件时置位，软件写1清零，或者软件读ATIM_CCR1自动清零 相关函数 */
void ATIM_ISR_CC1IF_Clr(void)
{
	ATIM->ISR = ATIM_ISR_CC1IF_Msk;
}

FlagStatus ATIM_ISR_CC1IF_Chk(void)
{
	if (ATIM->ISR & ATIM_ISR_CC1IF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 更新事件中断标志，硬件置位，软件写1清零 相关函数 */
void ATIM_ISR_UIF_Clr(void)
{
	ATIM->ISR = ATIM_ISR_UIF_Msk;
}

FlagStatus ATIM_ISR_UIF_Chk(void)
{
	if (ATIM->ISR & ATIM_ISR_UIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 软件刹车，软件置位此寄存器产生刹车事件，硬件自动清零 相关函数 */
void ATIM_EGR_BG_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->EGR |= (ATIM_EGR_BG_Msk);
	}
	else
	{
		ATIM->EGR &= ~(ATIM_EGR_BG_Msk);
	}
}

/* 软件触发，软件置位此寄存器产生触发事件，硬件自动清零 相关函数 */
void ATIM_EGR_TIF_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->EGR |= (ATIM_EGR_TIF_Msk);
	}
	else
	{
		ATIM->EGR &= ~(ATIM_EGR_TIF_Msk);
	}
}

/* 软件COM事件，硬件置位，软件写1清零 相关函数 */
void ATIM_EGR_COMG_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->EGR |= (ATIM_EGR_COMG_Msk);
	}
	else
	{
		ATIM->EGR &= ~(ATIM_EGR_COMG_Msk);
	}
}

/* 捕捉/比较通道4软件触发，参考CC1G 相关函数 */
void ATIM_EGR_CC4G_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->EGR |= (ATIM_EGR_CC4G_Msk);
	}
	else
	{
		ATIM->EGR &= ~(ATIM_EGR_CC4G_Msk);
	}
}

/* 捕捉/比较通道3软件触发，参考CC1G 相关函数 */
void ATIM_EGR_CC3G_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->EGR |= (ATIM_EGR_CC3G_Msk);
	}
	else
	{
		ATIM->EGR &= ~(ATIM_EGR_CC3G_Msk);
	}
}

/* 捕捉/比较通道2软件触发，参考CC1G 相关函数 */
void ATIM_EGR_CC2G_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->EGR |= (ATIM_EGR_CC2G_Msk);
	}
	else
	{
		ATIM->EGR &= ~(ATIM_EGR_CC2G_Msk);
	}
}

/* 捕捉/比较通道1软件触发 相关函数 */
void ATIM_EGR_CC1G_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->EGR |= (ATIM_EGR_CC1G_Msk);
	}
	else
	{
		ATIM->EGR &= ~(ATIM_EGR_CC1G_Msk);
	}
}

/* 软件Update事件，软件置位此寄存器产生Update事件，硬件自动清零 相关函数 */
void ATIM_EGR_UG_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->EGR |= (ATIM_EGR_UG_Msk);
	}
	else
	{
		ATIM->EGR &= ~(ATIM_EGR_UG_Msk);
	}
}

/* 输出比较2清零使能，参考OC1CE 相关函数 */
void ATIM_CCMR1_OC2CE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCMR1 |= (ATIM_CCMR1_OC2CE_Msk);
	}
	else
	{
		ATIM->CCMR1 &= ~(ATIM_CCMR1_OC2CE_Msk);
	}
}

FunState ATIM_CCMR1_OC2CE_Getable(void)
{
	if (ATIM->CCMR1 & (ATIM_CCMR1_OC2CE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较2模式配置，参考OC1M 相关函数 */
void ATIM_CCMR1_OC2M_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR1;
	tmpreg &= ~(ATIM_CCMR1_OC2M_Msk);
	tmpreg |= (SetValue & ATIM_CCMR1_OC2M_Msk);
	ATIM->CCMR1 = tmpreg;
}

uint32_t ATIM_CCMR1_OC2M_Get(void)
{
	return (ATIM->CCMR1 & ATIM_CCMR1_OC2M_Msk);
}

/* 输出比较2预装载使能，参考OC1PE 相关函数 */
void ATIM_CCMR1_OC2PE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCMR1 |= (ATIM_CCMR1_OC2PE_Msk);
	}
	else
	{
		ATIM->CCMR1 &= ~(ATIM_CCMR1_OC2PE_Msk);
	}
}

FunState ATIM_CCMR1_OC2PE_Getable(void)
{
	if (ATIM->CCMR1 & (ATIM_CCMR1_OC2PE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较2快速使能，参考OC1FE 相关函数 */
void ATIM_CCMR1_OC2FE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCMR1 |= (ATIM_CCMR1_OC2FE_Msk);
	}
	else
	{
		ATIM->CCMR1 &= ~(ATIM_CCMR1_OC2FE_Msk);
	}
}

FunState ATIM_CCMR1_OC2FE_Getable(void)
{
	if (ATIM->CCMR1 & (ATIM_CCMR1_OC2FE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较2通道选择 相关函数 */
void ATIM_CCMR1_CC2S_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR1;
	tmpreg &= ~(ATIM_CCMR1_CC2S_Msk);
	tmpreg |= (SetValue & ATIM_CCMR1_CC2S_Msk);
	ATIM->CCMR1 = tmpreg;
}

uint32_t ATIM_CCMR1_CC2S_Get(void)
{
	return (ATIM->CCMR1 & ATIM_CCMR1_CC2S_Msk);
}

/* 输出比较1清零使能 相关函数 */
void ATIM_CCMR1_OC1CE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCMR1 |= (ATIM_CCMR1_OC1CE_Msk);
	}
	else
	{
		ATIM->CCMR1 &= ~(ATIM_CCMR1_OC1CE_Msk);
	}
}

FunState ATIM_CCMR1_OC1CE_Getable(void)
{
	if (ATIM->CCMR1 & (ATIM_CCMR1_OC1CE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较1模式配置，此寄存器定义OC1REF信号的行为 相关函数 */
void ATIM_CCMR1_OC1M_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR1;
	tmpreg &= ~(ATIM_CCMR1_OC1M_Msk);
	tmpreg |= (SetValue & ATIM_CCMR1_OC1M_Msk);
	ATIM->CCMR1 = tmpreg;
}

uint32_t ATIM_CCMR1_OC1M_Get(void)
{
	return (ATIM->CCMR1 & ATIM_CCMR1_OC1M_Msk);
}

/* 输出比较1预装载使能 相关函数 */
void ATIM_CCMR1_OC1PE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCMR1 |= (ATIM_CCMR1_OC1PE_Msk);
	}
	else
	{
		ATIM->CCMR1 &= ~(ATIM_CCMR1_OC1PE_Msk);
	}
}

FunState ATIM_CCMR1_OC1PE_Getable(void)
{
	if (ATIM->CCMR1 & (ATIM_CCMR1_OC1PE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

