wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.c
/* 输出比较1快速使能 相关函数 */
void ATIM_CCMR1_OC1FE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCMR1 |= (ATIM_CCMR1_OC1FE_Msk);
	}
	else
	{
		ATIM->CCMR1 &= ~(ATIM_CCMR1_OC1FE_Msk);
	}
}

FunState ATIM_CCMR1_OC1FE_Getable(void)
{
	if (ATIM->CCMR1 & (ATIM_CCMR1_OC1FE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较1通道选择 相关函数 */
void ATIM_CCMR1_CC1S_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR1;
	tmpreg &= ~(ATIM_CCMR1_CC1S_Msk);
	tmpreg |= (SetValue & ATIM_CCMR1_CC1S_Msk);
	ATIM->CCMR1 = tmpreg;
}

uint32_t ATIM_CCMR1_CC1S_Get(void)
{
	return (ATIM->CCMR1 & ATIM_CCMR1_CC1S_Msk);
}

/* 输入捕捉2滤波 相关函数 */
void ATIM_CCMR1_IC2F_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR1;
	tmpreg &= ~(ATIM_CCMR1_IC2F_Msk);
	tmpreg |= (SetValue & ATIM_CCMR1_IC2F_Msk);
	ATIM->CCMR1 = tmpreg;
}

uint32_t ATIM_CCMR1_IC2F_Get(void)
{
	return (ATIM->CCMR1 & ATIM_CCMR1_IC2F_Msk);
}

/* 输入捕捉2预分频 相关函数 */
void ATIM_CCMR1_IC2PSC_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR1;
	tmpreg &= ~(ATIM_CCMR1_IC2PSC_Msk);
	tmpreg |= (SetValue & ATIM_CCMR1_IC2PSC_Msk);
	ATIM->CCMR1 = tmpreg;
}

uint32_t ATIM_CCMR1_IC2PSC_Get(void)
{
	return (ATIM->CCMR1 & ATIM_CCMR1_IC2PSC_Msk);
}

/* 输入捕捉1滤波 相关函数 */
void ATIM_CCMR1_IC1F_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR1;
	tmpreg &= ~(ATIM_CCMR1_IC1F_Msk);
	tmpreg |= (SetValue & ATIM_CCMR1_IC1F_Msk);
	ATIM->CCMR1 = tmpreg;
}

uint32_t ATIM_CCMR1_IC1F_Get(void)
{
	return (ATIM->CCMR1 & ATIM_CCMR1_IC1F_Msk);
}

/* 输入捕捉1预分频 相关函数 */
void ATIM_CCMR1_IC1PSC_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR1;
	tmpreg &= ~(ATIM_CCMR1_IC1PSC_Msk);
	tmpreg |= (SetValue & ATIM_CCMR1_IC1PSC_Msk);
	ATIM->CCMR1 = tmpreg;
}

uint32_t ATIM_CCMR1_IC1PSC_Get(void)
{
	return (ATIM->CCMR1 & ATIM_CCMR1_IC1PSC_Msk);
}

/* 输出比较4清零使能，参考OC1CE 相关函数 */
void ATIM_CCMR2_OC4CE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCMR2 |= (ATIM_CCMR2_OC4CE_Msk);
	}
	else
	{
		ATIM->CCMR2 &= ~(ATIM_CCMR2_OC4CE_Msk);
	}
}

FunState ATIM_CCMR2_OC4CE_Getable(void)
{
	if (ATIM->CCMR2 & (ATIM_CCMR2_OC4CE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

void ATIM_CCMR2_OC4M_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR2;
	tmpreg &= ~(ATIM_CCMR2_OC4M_Msk);
	tmpreg |= (SetValue & ATIM_CCMR2_OC4M_Msk);
	ATIM->CCMR2 = tmpreg;
}

uint32_t ATIM_CCMR2_OC4M_Get(void)
{
	return (ATIM->CCMR2 & ATIM_CCMR2_OC4M_Msk);
}

/* 输出比较4预装载使能，参考OC1PE 相关函数 */
void ATIM_CCMR2_OC4PE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCMR2 |= (ATIM_CCMR2_OC4PE_Msk);
	}
	else
	{
		ATIM->CCMR2 &= ~(ATIM_CCMR2_OC4PE_Msk);
	}
}

FunState ATIM_CCMR2_OC4PE_Getable(void)
{
	if (ATIM->CCMR2 & (ATIM_CCMR2_OC4PE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较4快速使能，参考OC1FE 相关函数 */
void ATIM_CCMR2_OC4FE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCMR2 |= (ATIM_CCMR2_OC4FE_Msk);
	}
	else
	{
		ATIM->CCMR2 &= ~(ATIM_CCMR2_OC4FE_Msk);
	}
}

FunState ATIM_CCMR2_OC4FE_Getable(void)
{
	if (ATIM->CCMR2 & (ATIM_CCMR2_OC4FE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较4通道选择 相关函数 */
void ATIM_CCMR2_CC4S_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR2;
	tmpreg &= ~(ATIM_CCMR2_CC4S_Msk);
	tmpreg |= (SetValue & ATIM_CCMR2_CC4S_Msk);
	ATIM->CCMR2 = tmpreg;
}

uint32_t ATIM_CCMR2_CC4S_Get(void)
{
	return (ATIM->CCMR2 & ATIM_CCMR2_CC4S_Msk);
}

/* 输出比较1清零使能 相关函数 */
void ATIM_CCMR2_OC3CE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCMR2 |= (ATIM_CCMR2_OC3CE_Msk);
	}
	else
	{
		ATIM->CCMR2 &= ~(ATIM_CCMR2_OC3CE_Msk);
	}
}

FunState ATIM_CCMR2_OC3CE_Getable(void)
{
	if (ATIM->CCMR2 & (ATIM_CCMR2_OC3CE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较3模式配置，此寄存器定义OC3REF信号的行为 相关函数 */
void ATIM_CCMR2_OC3M_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR2;
	tmpreg &= ~(ATIM_CCMR2_OC3M_Msk);
	tmpreg |= (SetValue & ATIM_CCMR2_OC3M_Msk);
	ATIM->CCMR2 = tmpreg;
}

uint32_t ATIM_CCMR2_OC3M_Get(void)
{
	return (ATIM->CCMR2 & ATIM_CCMR2_OC3M_Msk);
}

/* 输出比较3预装载使能 相关函数 */
void ATIM_CCMR2_OC3PE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCMR2 |= (ATIM_CCMR2_OC3PE_Msk);
	}
	else
	{
		ATIM->CCMR2 &= ~(ATIM_CCMR2_OC3PE_Msk);
	}
}

FunState ATIM_CCMR2_OC3PE_Getable(void)
{
	if (ATIM->CCMR2 & (ATIM_CCMR2_OC3PE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 输出比较3快速使能 相关函数 */
void ATIM_CCMR2_OC3FE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCMR2 |= (ATIM_CCMR2_OC3FE_Msk);
	}
	else
	{
		ATIM->CCMR2 &= ~(ATIM_CCMR2_OC3FE_Msk);
	}
}

FunState ATIM_CCMR2_OC3FE_Getable(void)
{
	if (ATIM->CCMR2 & (ATIM_CCMR2_OC3FE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较3通道选择 相关函数 */
void ATIM_CCMR2_CC3S_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR2;
	tmpreg &= ~(ATIM_CCMR2_CC3S_Msk);
	tmpreg |= (SetValue & ATIM_CCMR2_CC3S_Msk);
	ATIM->CCMR2 = tmpreg;
}

uint32_t ATIM_CCMR2_CC3S_Get(void)
{
	return (ATIM->CCMR2 & ATIM_CCMR2_CC3S_Msk);
}

/* 输入捕捉4滤波 相关函数 */
void ATIM_CCMR2_IC4F_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR2;
	tmpreg &= ~(ATIM_CCMR2_IC4F_Msk);
	tmpreg |= (SetValue & ATIM_CCMR2_IC4F_Msk);
	ATIM->CCMR2 = tmpreg;
}

uint32_t ATIM_CCMR2_IC4F_Get(void)
{
	return (ATIM->CCMR2 & ATIM_CCMR2_IC4F_Msk);
}

/* 输入捕捉4预分频 相关函数 */
void ATIM_CCMR2_IC4PSC_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR2;
	tmpreg &= ~(ATIM_CCMR2_IC4PSC_Msk);
	tmpreg |= (SetValue & ATIM_CCMR2_IC4PSC_Msk);
	ATIM->CCMR2 = tmpreg;
}

uint32_t ATIM_CCMR2_IC4PSC_Get(void)
{
	return (ATIM->CCMR2 & ATIM_CCMR2_IC4PSC_Msk);
}

/* 输入捕捉3滤波 相关函数 */
void ATIM_CCMR2_IC3F_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR2;
	tmpreg &= ~(ATIM_CCMR2_IC3F_Msk);
	tmpreg |= (SetValue & ATIM_CCMR2_IC3F_Msk);
	ATIM->CCMR2 = tmpreg;
}

uint32_t ATIM_CCMR2_IC3F_Get(void)
{
	return (ATIM->CCMR2 & ATIM_CCMR2_IC3F_Msk);
}

/* 输入捕捉3预分频 相关函数 */
void ATIM_CCMR2_IC3PSC_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCMR2;
	tmpreg &= ~(ATIM_CCMR2_IC3PSC_Msk);
	tmpreg |= (SetValue & ATIM_CCMR2_IC3PSC_Msk);
	ATIM->CCMR2 = tmpreg;
}

