wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.c
uint32_t ATIM_CCMR2_IC3PSC_Get(void)
{
	return (ATIM->CCMR2 & ATIM_CCMR2_IC3PSC_Msk);
}

/* 捕捉/比较4输出极性，参考CC1P 相关函数 */
void ATIM_CCER_CC4P_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCER;
	tmpreg &= ~(ATIM_CCER_CC4P_Msk);
	tmpreg |= (SetValue & ATIM_CCER_CC4P_Msk);
	ATIM->CCER = tmpreg;
}

uint32_t ATIM_CCER_CC4P_Get(void)
{
	return (ATIM->CCER & ATIM_CCER_CC4P_Msk);
}

/* 捕捉/比较4输出使能，参考CC1E 相关函数 */
void ATIM_CCER_CC4E_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCER |= (ATIM_CCER_CC4E_Msk);
	}
	else
	{
		ATIM->CCER &= ~(ATIM_CCER_CC4E_Msk);
	}
}

FunState ATIM_CCER_CC4E_Getable(void)
{
	if (ATIM->CCER & (ATIM_CCER_CC4E_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较3互补输出极性，参考CC1NP 相关函数 */
void ATIM_CCER_CC3NP_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCER;
	tmpreg &= ~(ATIM_CCER_CC3NP_Msk);
	tmpreg |= (SetValue & ATIM_CCER_CC3NP_Msk);
	ATIM->CCER = tmpreg;
}

uint32_t ATIM_CCER_CC3NP_Get(void)
{
	return (ATIM->CCER & ATIM_CCER_CC3NP_Msk);
}

/* 捕捉/比较3互补输出使能，参考CC1NE 相关函数 */
void ATIM_CCER_CC3NE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCER |= (ATIM_CCER_CC3NE_Msk);
	}
	else
	{
		ATIM->CCER &= ~(ATIM_CCER_CC3NE_Msk);
	}
}

FunState ATIM_CCER_CC3NE_Getable(void)
{
	if (ATIM->CCER & (ATIM_CCER_CC3NE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较3输出极性，参考CC1P 相关函数 */
void ATIM_CCER_CC3P_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCER;
	tmpreg &= ~(ATIM_CCER_CC3P_Msk);
	tmpreg |= (SetValue & ATIM_CCER_CC3P_Msk);
	ATIM->CCER = tmpreg;
}

uint32_t ATIM_CCER_CC3P_Get(void)
{
	return (ATIM->CCER & ATIM_CCER_CC3P_Msk);
}

/* 捕捉/比较3输出使能，参考CC1E 相关函数 */
void ATIM_CCER_CC3E_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCER |= (ATIM_CCER_CC3E_Msk);
	}
	else
	{
		ATIM->CCER &= ~(ATIM_CCER_CC3E_Msk);
	}
}

FunState ATIM_CCER_CC3E_Getable(void)
{
	if (ATIM->CCER & (ATIM_CCER_CC3E_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较2互补输出极性，参考CC1NP 相关函数 */
void ATIM_CCER_CC2NP_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCER;
	tmpreg &= ~(ATIM_CCER_CC2NP_Msk);
	tmpreg |= (SetValue & ATIM_CCER_CC2NP_Msk);
	ATIM->CCER = tmpreg;
}

uint32_t ATIM_CCER_CC2NP_Get(void)
{
	return (ATIM->CCER & ATIM_CCER_CC2NP_Msk);
}

/* 捕捉/比较2互补输出使能，参考CC1NE 相关函数 */
void ATIM_CCER_CC2NE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCER |= (ATIM_CCER_CC2NE_Msk);
	}
	else
	{
		ATIM->CCER &= ~(ATIM_CCER_CC2NE_Msk);
	}
}

FunState ATIM_CCER_CC2NE_Getable(void)
{
	if (ATIM->CCER & (ATIM_CCER_CC2NE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较2输出极性，参考CC1P 相关函数 */
void ATIM_CCER_CC2P_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCER;
	tmpreg &= ~(ATIM_CCER_CC2P_Msk);
	tmpreg |= (SetValue & ATIM_CCER_CC2P_Msk);
	ATIM->CCER = tmpreg;
}

uint32_t ATIM_CCER_CC2P_Get(void)
{
	return (ATIM->CCER & ATIM_CCER_CC2P_Msk);
}

/* 捕捉/比较2输出使能，参考CC1E 相关函数 */
void ATIM_CCER_CC2E_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCER |= (ATIM_CCER_CC2E_Msk);
	}
	else
	{
		ATIM->CCER &= ~(ATIM_CCER_CC2E_Msk);
	}
}

FunState ATIM_CCER_CC2E_Getable(void)
{
	if (ATIM->CCER & (ATIM_CCER_CC2E_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较1互补输出极性 相关函数 */
void ATIM_CCER_CC1NP_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCER;
	tmpreg &= ~(ATIM_CCER_CC1NP_Msk);
	tmpreg |= (SetValue & ATIM_CCER_CC1NP_Msk);
	ATIM->CCER = tmpreg;
}

uint32_t ATIM_CCER_CC1NP_Get(void)
{
	return (ATIM->CCER & ATIM_CCER_CC1NP_Msk);
}

/* 捕捉/比较1互补输出使能 相关函数 */
void ATIM_CCER_CC1NE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCER |= (ATIM_CCER_CC1NE_Msk);
	}
	else
	{
		ATIM->CCER &= ~(ATIM_CCER_CC1NE_Msk);
	}
}

FunState ATIM_CCER_CC1NE_Getable(void)
{
	if (ATIM->CCER & (ATIM_CCER_CC1NE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 捕捉/比较1输出极性 (CC1 Polarity)
CC1通道配置为输出时
0：OC1高电平active
1：OC1低电平active
CC1通道配置为输入时
0：非取反模式–捕捉在IC1的上升沿进行
1：取反模式–捕捉在IC1的下降沿进行 相关函数 */
void ATIM_CCER_CC1P_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->CCER;
	tmpreg &= ~(ATIM_CCER_CC1P_Msk);
	tmpreg |= (SetValue & ATIM_CCER_CC1P_Msk);
	ATIM->CCER = tmpreg;
}

uint32_t ATIM_CCER_CC1P_Get(void)
{
	return (ATIM->CCER & ATIM_CCER_CC1P_Msk);
}

/* 捕捉/比较1输出使能 (CC1 Enable)
CC1通道配置为输出时
0：OC1不active
1：OC1 active
CC1通道配置为输入时
0：关闭捕捉功能
1：使能捕捉功能 相关函数 */
void ATIM_CCER_CC1E_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->CCER |= (ATIM_CCER_CC1E_Msk);
	}
	else
	{
		ATIM->CCER &= ~(ATIM_CCER_CC1E_Msk);
	}
}

FunState ATIM_CCER_CC1E_Getable(void)
{
	if (ATIM->CCER & (ATIM_CCER_CC1E_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 计数器值 相关函数 */
void ATIM_CNT_Write(uint32_t SetValue)
{
	ATIM->CNT = (SetValue & ATIM_CNT_CNT_Msk);
}

uint32_t ATIM_CNT_Read(void)
{
	return (ATIM->CNT & ATIM_CNT_CNT_Msk);
}

/* 计数器时钟预分频值
fCK_CNT=fCK_PSC/(PSC[15:0]+1)
这是一个preload寄存器，在update事件发生时其内容被载入shadow寄存器 相关函数 */
void ATIM_PSC_Write(uint32_t SetValue)
{
	ATIM->PSC = (SetValue & ATIM_PSC_PSC_Msk);
}

uint32_t ATIM_PSC_Read(void)
{
	return (ATIM->PSC & ATIM_PSC_PSC_Msk);
}

/* 计数溢出时的自动重载值 
这是一个preload寄存器，在update事件发生时其内容被载入shadow寄存器 相关函数 */
void ATIM_ARR_Write(uint32_t SetValue)
{
	ATIM->ARR = (SetValue & ATIM_ARR_ARR_Msk);
}

uint32_t ATIM_ARR_Read(void)
{
	return (ATIM->ARR & ATIM_ARR_ARR_Msk);
}

/* 重复计数值  相关函数 */
void ATIM_RCR_Write(uint32_t SetValue)
{
	ATIM->RCR = (SetValue & ATIM_RCR_REP_Msk);
}

uint32_t ATIM_RCR_Read(void)
{
	return (ATIM->RCR & ATIM_RCR_REP_Msk);
}

/* 捕捉/比较通道1寄存器 
如果通道1配置为输出：
这是一个preload寄存器，其内容被载入shadow寄存器后用于与计数器比较产生OC1输出
如果通道1配置为输入：
CCR1保存最近一次输入捕捉事件发生时的计数器值，此时CCR1为只读 相关函数 */
void ATIM_CCR1_Write(uint32_t SetValue)
{
	ATIM->CCR1 = (SetValue & ATIM_CCR1_CCR1_Msk);
}

uint32_t ATIM_CCR1_Read(void)
{
	return (ATIM->CCR1 & ATIM_CCR1_CCR1_Msk);
}

/* 捕捉/比较通道2寄存器 
如果通道2配置为输出：
这是一个preload寄存器，其内容被载入shadow寄存器后用于与计数器比较产生OC2输出
如果通道2配置为输入：
CCR2保存最近一次输入捕捉事件发生时的计数器值，此时CCR2为只读 相关函数 */
void ATIM_CCR2_Write(uint32_t SetValue)
{
	ATIM->CCR2 = (SetValue & ATIM_CCR2_CCR2_Msk);
}

uint32_t ATIM_CCR2_Read(void)
{
	return (ATIM->CCR2 & ATIM_CCR2_CCR2_Msk);
}

/* 捕捉/比较通道3寄存器 
如果通道3配置为输出：
这是一个preload寄存器，其内容被载入shadow寄存器后用于与计数器比较产生OC3输出
如果通道3配置为输入：
CCR3保存最近一次输入捕捉事件发生时的计数器值，此时CCR3为只读 相关函数 */
void ATIM_CCR3_Write(uint32_t SetValue)
{
	ATIM->CCR3 = (SetValue & ATIM_CCR3_CCR3_Msk);
}

uint32_t ATIM_CCR3_Read(void)
{
	return (ATIM->CCR3 & ATIM_CCR3_CCR3_Msk);
}

