wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_atim.c
/* 捕捉/比较通道4寄存器 
如果通道4配置为输出：
这是一个preload寄存器，其内容被载入shadow寄存器后用于与计数器比较产生OC4输出
如果通道4配置为输入：
CCR4保存最近一次输入捕捉事件发生时的计数器值，此时CCR4为只读 相关函数 */
void ATIM_CCR4_Write(uint32_t SetValue)
{
	ATIM->CCR4 = (SetValue & ATIM_CCR4_CCR4_Msk);
}

uint32_t ATIM_CCR4_Read(void)
{
	return (ATIM->CCR4 & ATIM_CCR4_CCR4_Msk);
}

/* 输出使能主控 相关函数 */
void ATIM_BDTR_MOE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->BDTR |= (ATIM_BDTR_MOE_Msk);
	}
	else
	{
		ATIM->BDTR &= ~(ATIM_BDTR_MOE_Msk);
	}
}

FunState ATIM_BDTR_MOE_Getable(void)
{
	if (ATIM->BDTR & (ATIM_BDTR_MOE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 自动输出使能 相关函数 */
void ATIM_BDTR_AOE_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->BDTR;
	tmpreg &= ~(ATIM_BDTR_AOE_Msk);
	tmpreg |= (SetValue & ATIM_BDTR_AOE_Msk);
	ATIM->BDTR = tmpreg;
}

uint32_t ATIM_BDTR_AOE_Get(void)
{
	return (ATIM->BDTR & ATIM_BDTR_AOE_Msk);
}

void ATIM_BDTR_BKP_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->BDTR;
	tmpreg &= ~(ATIM_BDTR_BKP_Msk);
	tmpreg |= (SetValue & ATIM_BDTR_BKP_Msk);
	ATIM->BDTR = tmpreg;
}

uint32_t ATIM_BDTR_BKP_Get(void)
{
	return (ATIM->BDTR & ATIM_BDTR_BKP_Msk);
}

void ATIM_BDTR_BKE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->BDTR |= (ATIM_BDTR_BKE_Msk);
	}
	else
	{
		ATIM->BDTR &= ~(ATIM_BDTR_BKE_Msk);
	}
}

FunState ATIM_BDTR_BKE_Getable(void)
{
	if (ATIM->BDTR & (ATIM_BDTR_BKE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

void ATIM_BDTR_OSSR_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->BDTR;
	tmpreg &= ~(ATIM_BDTR_OSSR_Msk);
	tmpreg |= (SetValue & ATIM_BDTR_OSSR_Msk);
	ATIM->BDTR = tmpreg;
}

uint32_t ATIM_BDTR_OSSR_Get(void)
{
	return (ATIM->BDTR & ATIM_BDTR_OSSR_Msk);
}

void ATIM_BDTR_OSSI_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->BDTR;
	tmpreg &= ~(ATIM_BDTR_OSSI_Msk);
	tmpreg |= (SetValue & ATIM_BDTR_OSSI_Msk);
	ATIM->BDTR = tmpreg;
}

uint32_t ATIM_BDTR_OSSI_Get(void)
{
	return (ATIM->BDTR & ATIM_BDTR_OSSI_Msk);
}

/* 寄存器写保护配置 相关函数 */
void ATIM_BDTR_LOCK_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->BDTR;
	tmpreg &= ~(ATIM_BDTR_LOCK_Msk);
	tmpreg |= (SetValue & ATIM_BDTR_LOCK_Msk);
	ATIM->BDTR = tmpreg;
}

uint32_t ATIM_BDTR_LOCK_Get(void)
{
	return (ATIM->BDTR & ATIM_BDTR_LOCK_Msk);
}

/* 死区时间插入，用于配置互补输出插入的死区时间长度 相关函数 */
void ATIM_BDTR_DTG_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->BDTR;
	tmpreg &= ~(ATIM_BDTR_DTG_Msk);
	tmpreg |= (SetValue & ATIM_BDTR_DTG_Msk);
	ATIM->BDTR = tmpreg;
}

uint32_t ATIM_BDTR_DTG_Get(void)
{
	return (ATIM->BDTR & ATIM_BDTR_DTG_Msk);
}

/* DMA Burst长度 相关函数 */
void ATIM_DCR_DBL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->DCR;
	tmpreg &= ~(ATIM_DCR_DBL_Msk);
	tmpreg |= (SetValue & ATIM_DCR_DBL_Msk);
	ATIM->DCR = tmpreg;
}

uint32_t ATIM_DCR_DBL_Get(void)
{
	return (ATIM->DCR & ATIM_DCR_DBL_Msk);
}

/* DMA基地址，定义指向寄存器的偏移地址 相关函数 */
void ATIM_DCR_DBA_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->DCR;
	tmpreg &= ~(ATIM_DCR_DBA_Msk);
	tmpreg |= (SetValue & ATIM_DCR_DBA_Msk);
	ATIM->DCR = tmpreg;
}

uint32_t ATIM_DCR_DBA_Get(void)
{
	return (ATIM->DCR & ATIM_DCR_DBA_Msk);
}

/* DMA burst访问寄存器
在使用DMA burst传输时，将DMA通道外设地址设置为ATIM_DMAR，ATIM会根据DBL的值产生多次DMA请求 相关函数 */
void ATIM_DMAR_Write(uint32_t SetValue)
{
	ATIM->DMAR = (SetValue);
}

uint32_t ATIM_DMAR_Read(void)
{
	return (ATIM->DMAR);
}

/* ATIM_BRK2引脚输入门控信号 相关函数 */
void ATIM_BKCR_BRK2GATE_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->BKCR;
	tmpreg &= ~(ATIM_BKCR_BRK2GATE_Msk);
	tmpreg |= (SetValue & ATIM_BKCR_BRK2GATE_Msk);
	ATIM->BKCR = tmpreg;
}

uint32_t ATIM_BKCR_BRK2GATE_Get(void)
{
	return (ATIM->BKCR & ATIM_BKCR_BRK2GATE_Msk);
}

/* ATIM_BRK1引脚输入门控信号 相关函数 */
void ATIM_BKCR_BRK1GATE_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->BKCR;
	tmpreg &= ~(ATIM_BKCR_BRK1GATE_Msk);
	tmpreg |= (SetValue & ATIM_BKCR_BRK1GATE_Msk);
	ATIM->BKCR = tmpreg;
}

uint32_t ATIM_BKCR_BRK1GATE_Get(void)
{
	return (ATIM->BKCR & ATIM_BKCR_BRK1GATE_Msk);
}

/* 刹车信号的滤波时钟和长度选择  相关函数 */
void ATIM_BKCR_BRKF_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->BKCR;
	tmpreg &= ~(ATIM_BKCR_BRKF_Msk);
	tmpreg |= (SetValue & ATIM_BKCR_BRKF_Msk);
	ATIM->BKCR = tmpreg;
}

uint32_t ATIM_BKCR_BRKF_Get(void)
{
	return (ATIM->BKCR & ATIM_BKCR_BRKF_Msk);
}

/* 刹车组合控制 相关函数 */
void ATIM_BKCR_BRKCOMB_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = ATIM->BKCR;
	tmpreg &= ~(ATIM_BKCR_BRKCOMB_Msk);
	tmpreg |= (SetValue & ATIM_BKCR_BRKCOMB_Msk);
	ATIM->BKCR = tmpreg;
}

uint32_t ATIM_BKCR_BRKCOMB_Get(void)
{
	return (ATIM->BKCR & ATIM_BKCR_BRKCOMB_Msk);
}

/* XTHF停振检测刹车信号使能 相关函数 */
void ATIM_BKCR_HFDET_BRKEN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->BKCR |= (ATIM_BKCR_HFDET_BRKEN_Msk);
	}
	else
	{
		ATIM->BKCR &= ~(ATIM_BKCR_HFDET_BRKEN_Msk);
	}
}

FunState ATIM_BKCR_HFDET_BRKEN_Getable(void)
{
	if (ATIM->BKCR & (ATIM_BKCR_HFDET_BRKEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* SVD刹车信号使能 相关函数 */
void ATIM_BKCR_SVD_BRKEN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->BKCR |= (ATIM_BKCR_SVD_BRKEN_Msk);
	}
	else
	{
		ATIM->BKCR &= ~(ATIM_BKCR_SVD_BRKEN_Msk);
	}
}

FunState ATIM_BKCR_SVD_BRKEN_Getable(void)
{
	if (ATIM->BKCR & (ATIM_BKCR_SVD_BRKEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 比较器输出刹车信号使能 相关函数 */
void ATIM_BKCR_COMP_BRKEN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		ATIM->BKCR |= (ATIM_BKCR_COMP_BRKEN_Msk);
	}
	else
	{
		ATIM->BKCR &= ~(ATIM_BKCR_COMP_BRKEN_Msk);
	}
}

FunState ATIM_BKCR_COMP_BRKEN_Getable(void)
{
	if (ATIM->BKCR & (ATIM_BKCR_COMP_BRKEN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}


void ATIM_Deinit(void)
{
	RCC_PRST_EN_Write(RSTKEY0);
  RCC_APBRST_CR2_ATRST_Setable(ENABLE);  
  RCC_APBRST_CR2_ATRST_Setable(DISABLE);
  RCC_PRST_EN_Write(RSTKEY1);
}

/******END OF FILE****/
